# Intersecting Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PlanRegionFailures..::..Intersecting Property
BuiltInFailures..::..PlanRegionFailures Class See Also
---
The boundaries of the highlighted Plan Regions overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Intersecting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Intersecting As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Intersecting {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PlanRegionFailures Class
Autodesk.Revit.DB Namespace